# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 8  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  # - [9,12, 17,15, 25,28]  # P3/8
  # - [42,42, 91,56, 68,94]  # P4/16
  # - [177,101, 140,245, 555,343]  # P5/32

  - [ 5,6, 8,9, 15,17]  # P3/8
  - [26,28, 50,26, 40,52]  # P4/16
  - [82,52, 76,112, 178,109]  # P5/32

  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # input [b, 1, 640, 640]
  [[-1, 1, PatchEmbed, [32, 4]],  # 0 [b, 96, 160, 160]
   [-1, 1, SwinStage, [32, 2, 8, 7]],  # 1 [b, 96, 160, 160]
   [-1, 1, PatchMerging, [64]],    # 2 [b, 192, 80, 80]
   [-1, 1, SwinStage, [64, 2, 8, 7]],  # 3 --F0-- [b, 192, 80, 80]
   [ -1, 1, PatchMerging, [128]],   # 4 [b, 384, 40, 40]
   [ -1, 1, SwinStage, [128, 6, 8, 7]], # 5 --F1-- [b, 384, 40, 40]
   [ -1, 1, PatchMerging, [256]],   # 6 [b, 768, 20, 20]
   [ -1, 1, SwinStage, [256, 2, 8, 7]], # 7 --F2-- [b, 768, 20, 20]
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [256, False]],  # 11

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 15 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 18 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
railseg:
  #[[ 16, 1, Conv, [256, 3, 1]],                                     #25  分割模块
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #26
  #[ -1, 1, C3, [128, False]],                                       #27
  #[ -1, 1, Conv, [64, 3, 1]],                                      #28
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #29
  #[ -1, 1, Conv, [32, 3, 1]],                                      #30
  #[ -1, 1, C3, [16, False]],                                        #31
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32
  #[ -1, 1, Conv, [2, 3, 1]],                                       #33 
  #]
  #[[ 16, 1, Conv, [256, 3, 1]],                                     #25
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #26
  #[ -1, 1, C3, [128, False]],                                      #27
  #[ -1, 1, Conv, [64, 3, 1]],                                      #28
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #29
  #[ -1, 1, C3, [32, False]],                                        #30
  #[ -1, 1, Conv, [16, 3, 1]],                                      #31
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32
  #[ -1, 1, C3, [8, False]],                                         #33
  #[ -1, 1, Conv, [2, 3, 1]],                                       #34
  #] 

  [
   [ 15, 1, Conv, [128, 3, 1]],                                     #25  输入80*80*256  输出80*80*128  3*3卷积核
   #[ [-1,4], 1, Concat,[1]],
   #[ -1, 1, DySample, [4, 'lp']],                     #26  160*160*128
   #[ -1, 1, C3, [128,False]],
   [-1, 1, nn.Upsample, [None, 4, 'nearest']],
   [ -1, 1, C3, [64,False]],                                       #27  160*160*64
   [ -1, 1, Conv, [32, 3, 1]],                                      #28  160*160*32
   #[ -1, 1, DySample, [2, 'lp']],                     #29  320*320*32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #[ -1, 1, C3, [16, False]],                                       #30  320*320*16
   #[ -1, 1, Conv, [8, 3, 1]],                                       #31  320*320*8
   #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32  640*640*8
   [ -1, 1, C3, [8,False]],                                        #33  640*640*8
   [ -1, 1, Conv, [3, 3, 1]],                                       #34  640*640*3
  ]