
# Parameters
# 以convnext_tiny_1k为例
nc: 9  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  [[ ConvMod,[96, ]],
   [ ConvMod, [192,]],
   [ ConvMod, [384,]],
   [ ConvMod, [768,]],
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],
   [-1, 3, C3, [384, False]],

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, C3, [768, False]],

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [768, False]],  # 23 (P5/32-large)

   [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


railseg:
  #[[ 16, 1, Conv, [256, 3, 1]],                                     #25  分割模块
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #26
  #[ -1, 1, C3, [128, False]],                                       #27
  #[ -1, 1, Conv, [64, 3, 1]],                                      #28
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #29
  #[ -1, 1, Conv, [32, 3, 1]],                                      #30
  #[ -1, 1, C3, [16, False]],                                        #31
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32
  #[ -1, 1, Conv, [2, 3, 1]],                                       #33 
  #]
  #[[ 16, 1, Conv, [256, 3, 1]],                                     #25
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #26
  #[ -1, 1, C3, [128, False]],                                      #27
  #[ -1, 1, Conv, [64, 3, 1]],                                      #28
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #29
  #[ -1, 1, C3, [32, False]],                                        #30
  #[ -1, 1, Conv, [16, 3, 1]],                                      #31
  #[ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32
  #[ -1, 1, C3, [8, False]],                                         #33
  #[ -1, 1, Conv, [2, 3, 1]],                                       #34
  #] 

  [[ 17, 1, Conv, [128, 3, 1]],                                     #25
   [ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #26
   [ -1, 1, C3, [64, False]],                                       #27
   [ -1, 1, Conv, [32, 3, 1]],                                      #28
   [ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #29
   [ -1, 1, C3, [16, False]],                                       #30
   [ -1, 1, Conv, [8, 3, 1]],                                       #31
   [ -1, 1, nn.Upsample, [None, 2, 'nearest']],                     #32
   [ -1, 1, C3, [8, False]],                                        #33
   #[ -1, 1, SPMConv, [3, 3, 1]],                                   #34  条形池化
   [ -1, 1, Conv, [3, 3, 1]],                                       #34
  ]

